; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	image3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet4)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument5 image3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument8 thermograph0)
	(supports instrument8 image3)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon3)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 Star15)
	(pointing satellite2 Star14)
	(pointing satellite3 Planet12)
	(pointing satellite4 Planet12)
	(have_image Phenomenon3 spectrograph2)
	(have_image Planet4 thermograph1)
	(have_image Phenomenon5 thermograph1)
	(have_image Phenomenon7 spectrograph2)
	(have_image Planet8 image3)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 image3)
	(have_image Planet11 image3)
	(have_image Planet12 spectrograph2)
	(have_image Star13 spectrograph2)
	(have_image Star14 thermograph1)
	(have_image Star15 image3)
	(have_image Planet16 thermograph0)
	(have_image Star17 image3)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 19
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 19
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 19
4. (turn_to satellite4 groundstation1 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 groundstation1)
   goals met: 1 of 19
5. (calibrate satellite4 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 1 of 19
6. (turn_to satellite4 phenomenon10 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon10)
   goals met: 1 of 19
7. (take_image satellite4 phenomenon10 instrument8 image3)
   added: (have_image phenomenon10 image3)
   goals met: 2 of 19
8. (turn_to satellite4 phenomenon5 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon5)
   goals met: 2 of 19
9. (take_image satellite4 phenomenon5 instrument8 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 19
10. (turn_to satellite4 planet11 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet11)
   goals met: 3 of 19
11. (take_image satellite4 planet11 instrument8 image3)
   added: (have_image planet11 image3)
   goals met: 4 of 19
12. (turn_to satellite4 planet12 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet12)
   goals met: 5 of 19
13. (turn_to satellite2 star14 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star14)
   goals met: 6 of 19
14. (turn_to satellite1 star15 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star15)
   goals met: 7 of 19
15. (turn_to satellite0 phenomenon3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon3)
   goals met: 7 of 19
16. (take_image satellite0 phenomenon3 instrument0 spectrograph2)
   added: (have_image phenomenon3 spectrograph2)
   goals met: 8 of 19
17. (turn_to satellite0 phenomenon7 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon7)
   goals met: 8 of 19
18. (take_image satellite0 phenomenon7 instrument0 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 9 of 19
19. (turn_to satellite0 planet12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet12)
   goals met: 9 of 19
20. (take_image satellite0 planet12 instrument0 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 10 of 19
21. (turn_to satellite0 planet16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet16)
   goals met: 10 of 19
22. (take_image satellite0 planet16 instrument0 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 11 of 19
23. (turn_to satellite0 planet4 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet4)
   goals met: 11 of 19
24. (take_image satellite0 planet4 instrument0 thermograph1)
   added: (have_image planet4 thermograph1)
   goals met: 12 of 19
25. (turn_to satellite0 planet8 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet8)
   goals met: 13 of 19
26. (turn_to satellite4 planet8 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet8)
   goals met: 12 of 19
27. (take_image satellite4 planet8 instrument8 image3)
   added: (have_image planet8 image3)
   goals met: 13 of 19
28. (turn_to satellite4 planet12 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet12)
   goals met: 14 of 19
29. (turn_to satellite4 planet9 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet9)
   goals met: 13 of 19
30. (take_image satellite4 planet9 instrument8 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 14 of 19
31. (turn_to satellite4 planet12 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 planet12)
   goals met: 15 of 19
32. (turn_to satellite4 star14 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star14)
   goals met: 14 of 19
33. (take_image satellite4 star14 instrument8 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 15 of 19
34. (turn_to satellite4 planet12 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 planet12)
   goals met: 16 of 19
35. (turn_to satellite4 star15 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star15)
   goals met: 15 of 19
36. (take_image satellite4 star15 instrument8 image3)
   added: (have_image star15 image3)
   goals met: 16 of 19
37. (turn_to satellite4 planet12 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 planet12)
   goals met: 17 of 19
38. (turn_to satellite4 star17 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star17)
   goals met: 16 of 19
39. (take_image satellite4 star17 instrument8 image3)
   added: (have_image star17 image3)
   goals met: 17 of 19
40. (turn_to satellite4 planet12 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 planet12)
   goals met: 18 of 19
41. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 17 of 19
42. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 18 of 19
43. (turn_to satellite0 planet8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet8)
   goals met: 19 of 19
